#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/terrastates/QuackyNotesInfra/runs/run-5Rks4XhPyKLXGjM7

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo_PR_1 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_1" {
      + ami                                  = "ami-007855ac798b5175e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_1"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4f2b1beddf6aa9b25128c11df976348291361cfd"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.staging_key will be created
  + resource "aws_key_pair" "staging_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEXS4XAPmlEF+zzxRInttT2PocN/8l+0nvU7oRmFuusbUyBHJ2ZhpCTxvgJTa6MdD+z1+XeMJxPzS0Rt7VL1gY1JBz10+9oBWDqzbGanVC6XHiiTYFQeK3SKDK4Lc0IA2KxaO4yNeQeGMXJoVYXpM0a4NE6ASXtYeAIjnqlw53IZvuS8mGNpYe+1DrJzQxAeoC2v5o+bPfxCVZtR/CrCZinb7LdQTBskwepUeOZkqJbtbZNiysqqJsnaZuEK9mBCUisa0+2Kpv0wtAToKOfNo+QokKOdi5J6l/ZqOCwfkyiyJ9tlRAi9U9Yj166lEO9SGkIxeu8QlcbH8Sl4M+pW5zKfFr03BXUf+PQFXOZmozPD7gns3eAf6q7a+t20C3GZ/UU37hk4fteRHV8DClInJbqhvlPIf7peWb4i/ocAyX3BKGKuEtrYDGWMQxkeFoEodgOsAMxQ3KEX0HOUSCjtlpEN1lBbxqXDYLb0xdA900KKhEVYfkmnGrQprZDm9LCJwR94woPSQdt4GfXXpKx2Wr55NHRRmcULXcTAI1DroBawbO3seaZ+SOpVBCAhbg4SZ2FyAmJg24N8gh67o1N9iueS+0yVZKXfoepzvee55Y1ijYCaPtJI2nohWEVJMbGoJhXNcDWdS4byb6Z1R2tKpI4ivE60NDzKSFTqyaaMng0Q== ubuntu@staging-server"
      + tags            = {
          + "Name" = "staging_public_key"
        }
      + tags_all        = {
          + "Name" = "staging_public_key"
        }
    }

  # aws_security_group.staging_rules will be created
  + resource "aws_security_group" "staging_rules" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP access"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "staging_rules"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_tls"
        }
      + tags_all               = {
          + "Name" = "allow_tls"
        }
      + vpc_id                 = (known after apply)
    }

  # random_id.server_PR_1 will be created
  + resource "random_id" "server_PR_1" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "ami_id" = "ami-007855ac798b5175e"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + staging_dns_PR_1 = (known after apply)

```

</details>

*Pusher: @AndresDavidArcos, Action: `workflow_dispatch`*